<?php
  /**
   * This file is created
   * by jnxxhzz
   * @2019.04.08
  **/
?>


<?php
  // 共177个等级
  $level_total = 200;
  $max_strength = 210000;
  $level_strength = array(
    0,10,30,60,100,150,210,280,360, /*斗之气 魔法学徒*/ 
    450,550,660,780,910,1050,1200,1360,1530, /*斗者 见习魔法师*/ 
    1710,1900,2100,2310,2530,2760,3000,3250,3510, /*斗师 魔法师*/
    3780,4060,4350,4650,4960,5280,5610,5950,6300, /*大斗师 魔道学者*/ 
    6660,7030,7410,7800,8200,8610,9030,9460,9900,10350, /*斗灵 下位魔导士*/
    10810,11280,11760,12250,12750,13260,13780,14310,14850,15400, /*斗王 上位魔导士*/ 
    15960,16530,17110,17700,18300,18910,19530,20160,20800,21450, /*斗皇 大魔导士*/ 
    22110,22780,23460,24150,24850,25560,26280,27010,27750, /*斗宗1-3 禁咒法师1-3*/ 
    28500,29260,30030,30810,31600,32400,33210,34030,34860, /*斗宗4-6 禁咒法师4-6*/ 
    35700,36550,37410,38280,39160,40050,40950,41860,42780,/*斗宗7-9 禁咒法师7-9*/
    43710,44650,45600, /*斗宗巅峰 禁咒法师巅峰*/
    46560,47530,48510,49500,50500,51510,52530,53560,54600, /*斗尊1-3 圣魔导师1-3*/ 
    55650,56710,57780,58860,59950,61050,62160,63280,64410, /*斗尊4-6 圣魔导师4-6*/ 
    65550,66700,67860,69030,70210,71400,72600,73810,75030, /*斗尊7-9 圣魔导师7-9*/
    76260,77500,78750,80010,81280,82560,83850,85150,86460, /*斗尊巅峰1-9 元素圣魔导师-次元圣魔导师*/ 
    87780,89110,90450, /*半圣 半步法圣*/ 
    91800,93160,94530,95910,97300,98700,100110,101530,102960, /*斗圣1-3 法圣1-3*/ 
    104400,105850,107310,108780,110260,111750,113250,114760,116280, /*斗圣4-6 法神1-3*/
    117810,119350,120900,122460,124030,125610,127200,128800,130410, /*斗圣7-9 半步魔神-魔神-魔界至尊*/ 
    132030,133660,135300, /*斗圣巅峰 魔界至尊*/
    136950,138610,140280,141960,143650,145350,147060,148780,150510,152250,154000,155760, /*斗帝 奥术神座*/
  );


  $level_choose_name = array("魔法","斗气","军衔");
  
  $level_name_number=array_flip($level_choose_name);


  //registerpage显示的升级体系结构
  $levelup_system_show = array(
    array("魔法学徒","见习魔法师","魔法师","魔道学者","下位魔导士","上位魔导士","大魔导士",
          "禁咒法师","圣魔导师","元素圣魔导师","半步法圣",
          "法圣","魔界至尊","奥术神座"),
    array("斗之气","斗者","斗师","大斗师","斗灵","斗王","斗皇",
          "斗宗","斗尊","斗尊九转","半圣",
          "斗圣","斗圣巅峰","斗帝"),
    array("卫士","侍官","亭长","县尉","仁勇副尉","御侮校尉","宣节校尉",
          "翊麾校尉","定远将军","怀化中郎将","忠武将军",
          "云麾将军","骠骑大将军","天策上将")
  );
  $levelup_system_show_color = array(
    array(
        "#b6b6b6","#b6b6b6","#545454","#03A89E","#00a2ff","#0072ff","#000cff",
        "#ff009c","#d200ff","#ff0033","#FFCC99",
        "#FF8C00","#ff4e00","#FFCC00",
    ),
    array(
        "#b6b6b6","#b6b6b6","#545454","#03A89E","#00a2ff","#0072ff","#000cff",
        "#ff009c","#d200ff","#ff0033","#FFCC99",
        "#FF8C00","#ff4e00","#FFCC00",
    ),
    array(
        "#b6b6b6","#b6b6b6","#545454","#03A89E","#00a2ff","#0072ff","#000cff",
        "#ff009c","#d200ff","#ff0033","#FFCC99",
        "#FF8C00","#ff4e00","#FFCC00",
    )
  );

   $level_color = array(
    "#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6",  /*斗之气 魔法学徒*/
    "#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6",  /*斗者 见习魔法师*/
    "#545454","#545454","#545454","#545454","#545454","#545454","#545454","#545454","#545454",  /*斗师 魔法师*/
    "#03A89E","#03A89E","#03A89E","#03A89E","#03A89E","#03A89E","#03A89E","#03A89E","#03A89E",  /*大斗师 魔道学者*/
    "#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff",  /*斗灵 下位魔导士*/
    "#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff",  /*斗王 上位魔导士*/
    "#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff",   /*斗皇 大魔导士*/
    "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗1-3 禁咒法师1-3*/ 
    "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗4-6 禁咒法师4-6*/
    "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗7-9 禁咒法师7-9*/
    "#ff009c","#ff009c","#ff009c",  /*斗宗巅峰 初级圣魔导师*/
    "#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff",  /*斗尊1-3 圣魔导师1-3*/
    "#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff",  /*斗尊4-6 圣魔导师4-6*/
    "#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff",  /*斗尊7-9 圣魔导师7-9*/
    "#ff0033","#ff0033","#ff0033","#ff0033","#ff0033","#ff0033","#ff0033","#ff0033","#ff0033",  /*斗尊巅峰1-9 元素圣魔导师1-9*/ 
    "#FFCC99","#FFCC99","#FFCC99",  /*半圣 半步法圣*/ 
    "#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00",  /*斗圣1-3 法圣1-3*/ 
    "#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00",  /*斗圣4-6 法神1-3*/
    "#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00","#FF8C00",  /*斗圣7-9 半步魔神-魔神-魔界至尊*/ 
    "#ff4e00","#ff4e00","#ff4e00",  /*斗圣巅峰 魔界至尊*/
    "#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00","#FFCC00",  /*斗帝 奥术神座*/
    "#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000",  /*斗帝 奥术神座*/
    "#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000",  /**/
    "#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e" /**/
  );

  $level_name = array(
  array( 
    "一阶魔法学徒","二阶魔法学徒","三阶魔法学徒","四阶魔法学徒","五阶魔法学徒","六阶魔法学徒","七阶魔法学徒","八阶魔法学徒","九阶魔法学徒",
    "一阶见习魔法师","二阶见习魔法师","三阶见习魔法师","四阶见习魔法师","五阶见习魔法师","六阶见习魔法师","七阶见习魔法师","八阶见习魔法师","九阶见习魔法师",
    "一阶魔法师","二阶魔法师","三阶魔法师","四阶魔法师","五阶魔法师","六阶魔法师","七阶魔法师","八阶魔法师","九阶魔法师",
    "一阶魔道学者","二阶魔道学者","三阶魔道学者","四阶魔道学者","五阶魔道学者","六阶魔道学者","七阶魔道学者","八阶魔道学者","九阶魔道学者","巅峰魔道学者",
    "一阶下位魔导士","二阶下位魔导士","三阶下位魔导士","四阶下位魔导士","五阶下位魔导士","六阶下位魔导士","七阶下位魔导士","八阶下位魔导士","九阶下位魔导士","预备上位魔导士",
    "一阶上位魔导士","二阶上位魔导士","三阶上位魔导士","四阶上位魔导士","五阶上位魔导士","六阶上位魔导士","七阶上位魔导士","八阶上位魔导士","九阶上位魔导士","巅峰魔导士",
    "一阶大魔导士","二阶大魔导士","三阶大魔导士","四阶大魔导士","五阶大魔导士","六阶大魔导士","七阶大魔导士","八阶大魔导士","九阶大魔导士","顶级大魔导士",
    "一星禁咒法师前期","一星禁咒法师中期","一星禁咒法师后期","二星禁咒法师前期","二星禁咒法师中期","二星禁咒法师后期","三星禁咒法师前期","三星禁咒法师中期","三星禁咒法师后期",
    "四星禁咒法师前期","四星禁咒法师中期","四星禁咒法师后期","五星禁咒法师前期","五星禁咒法师中期","五星禁咒法师后期","六星禁咒法师前期","六星禁咒法师中期","六星禁咒法师后期",
    "七星禁咒法师前期","七星禁咒法师中期","七星禁咒法师后期","八星禁咒法师前期","八星禁咒法师中期","八星禁咒法师后期","九星禁咒法师前期","九星禁咒法师中期","九星禁咒法师后期",
    "初级圣魔导师前期","初级圣魔导师中期","初级圣魔导师后期",
    "一星圣魔导师前期","一星圣魔导师中期","一星圣魔导师后期","二星圣魔导师前期","二星圣魔导师中期","二星圣魔导师后期","三星圣魔导师前期","三星圣魔导师中期","三星圣魔导师后期",
    "四星圣魔导师前期","四星圣魔导师中期","四星圣魔导师后期","五星圣魔导师前期","五星圣魔导师中期","五星圣魔导师后期","六星圣魔导师前期","六星圣魔导师中期","六星圣魔导师后期",
    "七星圣魔导师前期","七星圣魔导师中期","七星圣魔导师后期","八星圣魔导师前期","八星圣魔导师中期","八星圣魔导师后期","九星圣魔导师前期","九星圣魔导师中期","九星圣魔导师后期",
    "初级元素圣魔导师","双系元素圣魔导师","三系元素圣魔导师","四系元素圣魔导师","全系元素圣魔导师","初级次元圣魔导师","中级次元圣魔导师","高级次元圣魔导师","顶级圣魔导师",
    "半步法圣前期","半步法圣中期","半步法圣后期",
    "一阶法圣前期","一阶法圣中期","一阶法圣后期","二阶法圣前期","二阶法圣中期","二阶法圣后期","三阶法圣前期","三阶法圣中期","三阶法圣后期",
    "一阶法神前期","一阶法神中期","一阶法神后期","二阶法神前期","二阶法神中期","二阶法神后期","巅峰法神前期","巅峰法神中期","巅峰法神后期",
    "半步魔神前期","半步魔神中期","半步魔神后期","魔神前期","魔神中期","魔神后期","魔界至尊","魔界至尊","魔界至尊",
    "魔界至尊","魔界至尊","魔界至尊",
    "奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座","奥术神座"
  ),

  array(
    "斗之气一段","斗之气二段","斗之气三段","斗之气四段","斗之气五段","斗之气六段","斗之气七段","斗之气八段","斗之气九段",
    "斗者一星","斗者二星","斗者三星","斗者四星","斗者五星","斗者六星","斗者七星","斗者八星","斗者九星",
    "斗师一星","斗师二星","斗师三星","斗师四星","斗师五星","斗师六星","斗师七星","斗师八星","斗师九星",
    "大斗师一星","大斗师二星","大斗师三星","大斗师四星","大斗师五星","大斗师六星","大斗师七星","大斗师八星","大斗师九星",
    "斗灵一星","斗灵二星","斗灵三星","斗灵四星","斗灵五星","斗灵六星","斗灵七星","斗灵八星","斗灵九星","斗灵巅峰",
    "斗王一星","斗王二星","斗王三星","斗王四星","斗王五星","斗王六星","斗王七星","斗王八星","斗王九星","斗王巅峰",
    "斗皇一星","斗皇二星","斗皇三星","斗皇四星","斗皇五星","斗皇六星","斗皇七星","斗皇八星","斗皇九星","斗皇巅峰",
    "斗宗一星前期","斗宗一星中期","斗宗一星后期","斗宗二星前期","斗宗二星中期","斗宗二星后期","斗宗三星前期","斗宗三星中期","斗宗三星后期",
    "斗宗四星前期","斗宗四星中期","斗宗四星后期","斗宗五星前期","斗宗五星中期","斗宗五星后期","斗宗六星前期","斗宗六星中期","斗宗六星后期",
    "斗宗七星前期","斗宗七星中期","斗宗七星后期","斗宗八星前期","斗宗八星中期","斗宗八星后期","斗宗九星前期","斗宗九星中期","斗宗九星后期",
    "斗宗巅峰前期","斗宗巅峰中期","斗宗巅峰后期",
    "斗尊一星前期","斗尊一星中期","斗尊一星后期","斗尊二星前期","斗尊二星中期","斗尊二星后期","斗尊三星前期","斗尊三星中期","斗尊三星后期",
    "斗尊四星前期","斗尊四星中期","斗尊四星后期","斗尊五星前期","斗尊五星中期","斗尊五星后期","斗尊六星前期","斗尊六星中期","斗尊六星后期",
    "斗尊七星前期","斗尊七星中期","斗尊七星后期","斗尊八星前期","斗尊八星中期","斗尊八星后期","斗尊九星前期","斗尊九星中期","斗尊九星后期",
    "斗尊一转","斗尊二转","斗尊三转","斗尊四转","斗尊五转","斗尊六转","斗尊七转","斗尊八转","斗尊九转",
    "半圣前期","半圣中期","半圣后期",
    "斗圣一星前期","斗圣一星中期","斗圣一星后期","斗圣二星前期","斗圣二星中期","斗圣二星后期","斗圣三星前期","斗圣三星中期","斗圣三星后期",
    "斗圣四星前期","斗圣四星中期","斗圣四星后期","斗圣五星前期","斗圣五星中期","斗圣五星后期","斗圣六星前期","斗圣六星中期","斗圣六星后期",
    "斗圣七星前期","斗圣七星中期","斗圣七星后期","斗圣八星前期","斗圣八星中期","斗圣八星后期","斗圣九星前期","斗圣九星中期","斗圣九星后期",
    "斗圣巅峰前期","斗圣巅峰中期","斗圣巅峰后期",
    "斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝","斗帝"
  ),
  array(
    "九等卫士","八等卫士","七等卫士","六等卫士","五等卫士","四等卫士","三等卫士","二等卫士","一等卫士",
    "九等侍官","八等侍官","七等侍官","六等侍官","五等侍官","四等侍官","三等侍官","二等侍官","一等侍官",
    "九等亭长","八等亭长","七等亭长","六等亭长","五等亭长","四等亭长","三等亭长","二等亭长","一等亭长",
    "九等县尉","八等县尉","七等县尉","六等县尉","五等县尉","四等县尉","三等县尉","二等县尉","一等县尉",
    "九等仁勇校尉","八等仁勇校尉","七等仁勇校尉","六等仁勇校尉","五等仁勇校尉","四等仁勇校尉","三等仁勇校尉","二等仁勇校尉","一等仁勇校尉","预备御侮校尉",
    "九等御侮校尉","八等御侮校尉","七等御侮校尉","六等御侮校尉","五等御侮校尉","四等御侮校尉","三等御侮校尉","二等御侮校尉","一等御侮校尉","预备宣节校尉",
    "九等宣节校尉","八等宣节校尉","七等宣节校尉","六等宣节校尉","五等宣节校尉","四等宣节校尉","三等宣节校尉","二等宣节校尉","一等宣节校尉","预备翊麾校尉",
    "九等翊麾校尉","八等翊麾校尉","七等翊麾校尉","六等翊麾校尉","五等翊麾校尉","四等翊麾校尉","三等翊麾校尉","二等翊麾校尉","一等翊麾校尉",
    "九等振威校尉","八等振威校尉","七等振威校尉","六等振威校尉","五等振威校尉","四等振威校尉","三等振威校尉","二等振威校尉","一等振威校尉",
    "九等昭武校尉","八等昭武校尉","七等昭武校尉","六等昭武校尉","五等昭武校尉","四等昭武校尉","三等昭武校尉","二等昭武校尉","一等昭武校尉",
    "三等宁远将军","二等宁远将军","一等宁远将军",
    "九等定远将军","八等定远将军","七等定远将军","六等定远将军","五等定远将军","四等定远将军","三等定远将军","二等定远将军","一等定远将军",
    "九等王府典军","八等王府典军","七等王府典军","六等王府典军","五等王府典军","四等王府典军","三等王府典军","二等王府典军","一等王府典军",
    "九等宣威将军","八等宣威将军","七等宣威将军","六等宣威将军","五等宣威将军","四等宣威将军","三等宣威将军","二等宣威将军","一等宣威将军",
    "九等怀化中郎将","八等怀化中郎将","七等怀化中郎将","六等怀化中郎将","五等怀化中郎将","四等怀化中郎将","三等怀化中郎将","二等怀化中郎将","一等怀化中郎将",
    "三等忠武将军","二等忠武将军","一等忠武将军",
    "九等云麾将军","八等云麾将军","七等云麾将军","六等云麾将军","五等云麾将军","四等云麾将军","三等云麾将军","二等云麾将军","一等云麾将军",
    "九等怀化大将军","八等怀化大将军","七等怀化大将军","六等怀化大将军","五等怀化大将军","四等怀化大将军","三等怀化大将军","二等怀化大将军","一等怀化大将军",
    "九等辅国大将军","八等辅国大将军","七等辅国大将军","六等辅国大将军","五等辅国大将军","四等辅国大将军","三等辅国大将军","二等辅国大将军","一等辅国大将军",
    "骠骑大将军","骠骑大将军","骠骑大将军",
    "天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将","天策上将"
  )
  // array(
  //   "新兵I","新兵II","新兵III","新兵IV","新兵V","新兵VI","新兵VII","新兵VIII","新兵IX",
  //   "二等兵I","二等兵II","二等兵III","二等兵IV","二等兵V","二等兵VI","二等兵VII","二等兵VIII","二等兵IX",
  //   "一等兵I","一等兵II","一等兵III","一等兵IV","一等兵V","一等兵VI","一等兵VII","一等兵VIIIVIII","一等兵IX",
  //   "下士I","下士II","下士III","下士IV","下士V","下士VI","下士VII","下士VIII","下士IX",
  //   "中士I","中士II","中士III","中士IV","中士V","中士VI","中士VII","中士VIII","中士IX","中士X",
  //   "上士I","上士II","上士III","上士IV","上士V","上士VI","上士VII","上士VIII","上士IX","上士X",
  //   "准尉I","准尉II","准尉III","准尉IV","准尉V","准尉VI","准尉VII","准尉VIII","准尉IX","准尉X",
  //   "少尉I","少尉II","少尉III","少尉IV","少尉V","少尉VI","少尉VII","少尉VIII","少尉IX",
  //   "中尉I","中尉II","中尉III","中尉IV","中尉V","中尉VI","中尉VII","中尉VIII","中尉IX",
  //   "上尉I","上尉II","上尉III","上尉IV","上尉V","上尉VI","上尉VII","上尉VIII","上尉IX",
  //   "大尉I","大尉II","大尉III",
  //   "少校I","少校II","少校III","少校IV","少校V","少校VI","少校VII","少校VIII","少校IX",
  //   "中校I","中校II","中校III","中校IV","中校V","中校VI","中校VII","中校VIII","中校IX",
  //   "上校I","上校II","上校III","上校IV","上校V","上校VI","上校VII","上校VIII","上校IX",
  //   "准将I","准将II","准将III","准将IV","准将V","准将VI","准将VII","准将VIII","准将IX",
  //   "少将I","少将II","少将III",
  //   "中将I","中将II","中将III","中将IV","中将V","中将VI","中将VII","中将VIII","中将IX",
  //   "上将I","上将II","上将III","上将IV","上将V","上将VI","上将VII","上将VIII","上将IX",
  //   "大将I","大将II","大将III","大将IV","大将V","大将VI","大将VII","大将VIII","大将IX",
  //   "元帅I","元帅II","元帅III",
  //   "总统I","总统","总统","总统","总统","总统","总统","总统","总统","总统","总统","总统"
  // )
  );

  // $level_color = array(
  //   "#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6","#b6b6b6",  /*斗之气*/
  //   "#545454","#545454","#545454","#545454","#545454","#545454","#545454","#545454","#545454",  /*斗者*/
  //   "#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff","#00a2ff",  /*斗师*/
  //   "#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff","#0072ff",  /*大斗师*/
  //   "#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff","#000cff",  /*斗灵*/
  //   "#8400ff","#8400ff","#8400ff","#8400ff","#8400ff","#8400ff","#8400ff","#8400ff","#8400ff","#8400ff",  /*斗王*/
  //   "#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff","#d200ff",  /*斗皇*/
  //   "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗1-3*/
  //   "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗4-6*/
  //   "#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c","#ff009c",  /*斗宗7-巅峰*/
  //   "#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00",  /*斗尊1-3*/
  //   "#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00",  /*斗尊4-6*/
  //   "#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00","#c64b00",  /*斗尊7-9*/
  //   "#e97300","#e97300","#e97300","#e97300","#e97300","#e97300","#e97300","#e97300","#e97300",  /*斗尊九转*/
  //   "#ff4e00","#ff4e00","#ff4e00",  /*半圣*/
  //   "#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000",  /*斗圣1-3*/
  //   "#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000",  /*斗圣4-6*/
  //   "#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000","#ff0000",  /*斗圣7-巅峰*/
  //   "#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000","#8d0000",  /*斗帝*/
  //   "#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000","#000000",  /*斗帝主*/
  //   "#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e","#00b51e" /*斗比*/
  // );
?>


